Revit 2026 API

# PathReinforcementAdditionalOffset Property

---

Additional offset of rebars in the Path Reinforcement.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double AdditionalOffset { get; set; }
```
```vb
Public Property AdditionalOffset As Double
	Get
	Set
```
```cpp
public:
property double AdditionalOffset {
	double get ();
	void set (double value);
}
```
```fsharp
member AdditionalOffset : float with get, set
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: The given value for offset must be no more than 30000 feet in absolute value. |

The method moves both primary and alternating bars.

#### Reference

PathReinforcement Class

Autodesk.Revit.DB.Structure Namespace